load-test/simple-load-test.yml
config:
  # target: http://localhost:3000
  target: http://localhost:8080
  phases:
    # This seems to be a good test for now.
    # Things start to fail in phase 3 and the response times start to increase, but it's not too bad.
    - duration: 10
      arrivalRate: 1
      rampTo: 100
      name: phase 1
    - duration: 10
      arrivalRate: 100
      rampTo: 500
      name: phase 2
    - duration: 10
      arrivalRate: 500
      rampTo: 2500
      name: phase 3
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/"
        count: 10